SMMB-DEV/STM32-Tools/Log.hpp
	#if __has_include("usbd_cdc_if.h")
	#include "usbd_cdc_if.h"
	
	extern "C" USBD_HandleTypeDef hUsbDeviceFS;
	
	inline void default_output_vcp(strv data, bool last_chunk)
	{
		static constexpr uint32_t TIMEOUT = 50;
		
		static char s_buf[CDC_DATA_FS_MAX_PACKET_SIZE];
		static size_t s_index = 0;
		
		static auto send = [](const char *buf, uint16_t len)
		{
			const uint32_t start = HAL_GetTick();
			
			while (hUsbDeviceFS.dev_state == USBD_STATE_CONFIGURED
				&& CDC_Transmit_FS(const_cast<uint8_t *>(reinterpret_cast<const uint8_t *>(buf)), len) == USBD_BUSY
				&& HAL_GetTick() - start < TIMEOUT);
		};
		
		
		if (s_index)
		{
			if (s_index + data.size() < std::size(s_buf))
			{
				std::memcpy(s_buf + s_index, data.data(), data.size());
				s_index += data.size();
				
				if (last_chunk)
				{
					send(s_buf, s_index);
					s_index = 0;
				}
				
				return;
			}
			
			const size_t copied = std::size(s_buf) - s_index;
			std::memcpy(s_buf + s_index, data.data(), copied);
			
			send(s_buf, std::size(s_buf));
			s_index = 0;
			data.remove_prefix(copied);
		}
		
		// todo: Send all at once for last_chunk?
		while (data.size() >= std::size(s_buf))
		{
			send(data.data(), std::size(s_buf));
			data.remove_prefix(std::size(s_buf));
		}
		
		if (!last_chunk)
		{
			std::memcpy(s_buf, data.data(), data.size());
			s_index = data.size();
		}
		else
			send(data.data(), data.size());
	}
	#endif	// __has_include("usbd_cdc_if.h")
	
	template <size_t OUTPUT_COUNT = 1>
	class Logger
	{
	public:
		Level level;
		strv name;
		std::array<output_t, OUTPUT_COUNT> outputs;
		timestamp_t timestamp = default_timestamp;
		handler_t error_handler = nullptr, fatal_handler = nullptr;
		
		constexpr Logger(Level level, strv name) : level(level), name(name), outputs(std::array{default_output_stdout}) {}
		constexpr Logger(Level level, strv name, std::array<output_t, OUTPUT_COUNT> outputs) : level(level), name(name), outputs(outputs) {}
		
		constexpr Logger(Level level, strv name, timestamp_t timestamp) :
			level(level), name(name), outputs(std::array{default_output_stdout}), timestamp(timestamp) {}
		
		constexpr Logger(Level level, strv name, std::array<output_t, OUTPUT_COUNT> outputs, timestamp_t timestamp) :
			level(level), name(name), outputs(outputs), timestamp(timestamp) {}
		
		constexpr Logger(Level level, strv name, std::array<output_t, OUTPUT_COUNT> outputs, timestamp_t timestamp, handler_t error_handler, handler_t fatal_handler) :
			level(level), name(name), outputs(outputs), timestamp(timestamp), error_handler(error_handler), fatal_handler(fatal_handler) {}
		
		constexpr Logger Clone() const { return Logger(level, name, outputs, timestamp, error_handler, fatal_handler); }
		constexpr Logger Clone(strv name) const { return Logger(level, name, outputs, timestamp, error_handler, fatal_handler); }
		constexpr Logger Clone(Level level, strv name) const { return Logger(level, name, outputs, timestamp, error_handler, fatal_handler); }
		
		constexpr bool isEnabled() const { return level > Level::None; }
		constexpr bool isEnabled(const Level level) const { return this->level >= level; }
		
		void log(const Level level, const char *fmt, ...) const
		{
			if (!isEnabled(level))
				return;
			
			va_list args;
			va_start(args, fmt);
			log(level, fmt, args);
			va_end(args);
		}
		
		void log(const Level level, const char *fmt, va_list args) const
		{
			if (!isEnabled(level))
				return;
			
			if (level > Level::None)
			{
				if (timestamp)
					dispatch_format(timestamp());
				
				if (level != Level::Max)
					dispatch_format(LevelStr(level));
				
				if (!name.empty())
					dispatch_format(name);
				
				dispatch_chunk(": "sv);
			}
			
			size_t written = 0;
			
			const char *p = fmt;
			for (; *p; p++)
			{
				if (*p != '%')
					continue;
				
				dispatch_chunk({fmt, (size_t)(p - fmt)});	// dispatch plain text
				written += p - fmt;
				
				const char *const start = p++;
				
				char flags[5 + 1], field_width[2 + 1], precision[3 + 1] = {}, modifier[2 + 1],		// precision must be initialized
					spec[std::size(flags) - 1 + std::size(field_width) - 1 + std::size(precision) - 1 + std::size(modifier) - 1 + 1 + 1];
				
				if (!extract_conv_spec("-+ #0", flags, sizeof(flags), p))
					return;
				
				if (!extract_conv_spec("*0123456789", field_width, sizeof(field_width), p))
					return;
				
				if (!extract_conv_spec(".*0123456789", precision, sizeof(precision), p))
					return;
				
				if (!extract_conv_spec("hlLzjt", modifier, sizeof(modifier), p))
					return;
				
				memcpy(spec, start, p + 1 - start);
				spec[p + 1 - start] = '\0';
				fmt = p + 1;
				
				const bool has_field_width = strcmp(field_width, "*") == 0, has_precision = strcmp(precision, ".*") == 0;
				
				char var[100];
				int n = 0;
				
				switch (*p)
				{
					case 'd': case 'i':
					{
						if (strcmp(modifier, "l") == 0)
							n = format<long>(var, sizeof(var), spec, has_field_width, has_precision, args);
						else if (strcmp(modifier, "ll") == 0)
							n = format<long long>(var, sizeof(var), spec, has_field_width, has_precision, args);
						else if (strcmp(modifier, "j") == 0)
							n = format<intmax_t>(var, sizeof(var), spec, has_field_width, has_precision, args);
						else if (strcmp(modifier, "z") == 0)
							n = format<std::make_signed<size_t>>(var, sizeof(var), spec, has_field_width, has_precision, args);
						else if (strcmp(modifier, "t") == 0)
							n = format<ptrdiff_t>(var, sizeof(var), spec, has_field_width, has_precision, args);
						else
							n = format<int>(var, sizeof(var), spec, has_field_width, has_precision, args);
						
						break;
					}
					
					case 'u': case 'x': case 'X': case 'o':
					{
						if (strcmp(modifier, "l") == 0)
							n = format<unsigned long>(var, sizeof(var), spec, has_field_width, has_precision, args);
						else if (strcmp(modifier, "ll") == 0)
							n = format<unsigned long long>(var, sizeof(var), spec, has_field_width, has_precision, args);
						else if (strcmp(modifier, "j") == 0)
							n = format<uintmax_t>(var, sizeof(var), spec, has_field_width, has_precision, args);
						else if (strcmp(modifier, "z") == 0)
							n = format<size_t>(var, sizeof(var), spec, has_field_width, has_precision, args);
						else if (strcmp(modifier, "t") == 0)
							n = format<std::make_unsigned<ptrdiff_t>>(var, sizeof(var), spec, has_field_width, has_precision, args);
						else
							n = format<unsigned int>(var, sizeof(var), spec, has_field_width, has_precision, args);
						
						break;
					}
					
					case 'f': case 'F': case 'g': case 'G': case 'e': case 'E': case 'a': case 'A':
					{
						if (strcmp(modifier, "L") == 0)
							n = format<long double>(var, sizeof(var), spec, has_field_width, has_precision, args);
						else
							n = format<double>(var, sizeof(var), spec, has_field_width, has_precision, args);
						
						break;
					}
					
