SMMB-DEV/STM32-Tools/Log.hpp
					case 'c':
					{
						if (strcmp(modifier, "l") == 0)
							n = format<wint_t>(var, sizeof(var), spec, has_field_width, has_precision, args);
						else
							n = format<int>(var, sizeof(var), spec, has_field_width, has_precision, args);
						
						break;
					}
					
					case 's':
					{
						if (strcmp(modifier, "l") == 0)
							n = format<const wchar_t *>(var, sizeof(var), spec, has_field_width, has_precision, args);
						else
						{
							if (strcmp(spec, "%s") == 0 || strcmp(spec, "%.*s") == 0)
							{
								int precision = INT_MAX;
								if (has_precision)
									precision = va_arg(args, int);
								
								if (precision < 0)
									precision = INT_MAX;
								
								const char *buf = va_arg(args, const char *);
								const size_t len = std::min(std::strlen(buf), size_t(precision));
								
								if (len > 0)
								{
									dispatch_chunk({buf, len});
									written += len;
								}
							}
							else
								n = format<const char *>(var, sizeof(var), spec, has_field_width, has_precision, args);
						}
						
						break;
					}
					
					case 'p':
					{
						if (strcmp(modifier, "") != 0)
							return;
						
						n = format<void *>(var, sizeof(var), spec, has_field_width, has_precision, args);
						break;
					}
					
					case 'n':
					{
						if (strcmp(flags, "") != 0 || strcmp(field_width, "") != 0 || strcmp(precision, "") != 0)
							return;
						
						if (strcmp(modifier, "hh") == 0)
							*va_arg(args, signed char *) = written;
						else if (strcmp(modifier, "h") == 0)
							*va_arg(args, short *) = written;
						else if (strcmp(modifier, "l") == 0)
							*va_arg(args, long *) = written;
						else if (strcmp(modifier, "ll") == 0)
							*va_arg(args, long long *) = written;
						else if (strcmp(modifier, "j") == 0)
							*va_arg(args, intmax_t *) = written;
						else if (strcmp(modifier, "z") == 0)
							*va_arg(args, size_t *) = written;
						else if (strcmp(modifier, "t") == 0)
							*va_arg(args, ptrdiff_t *) = written;
						else
							*va_arg(args, int *) = written;
						
						break;
					}
					
					case '%':
					{
						if (strcmp(spec, "%%") != 0)	// must match
							return;
						
						dispatch_chunk("%", 1);
						written++;
						break;
					}
					
					case 'b': case 'B':	// custom - modifiers same as o, x, X, and u
					{
						int fw = 0, prec = 1;
						
						if (has_field_width)
							fw = va_arg(args, int);
						else
							strv(field_width).to_num(fw);
						
						if (has_precision)
							prec = va_arg(args, int);
						else
							strv(precision + 1).to_num(prec);
						
						uintmax_t val;
						size_t size;
						
						if (strcmp(modifier, "l") == 0)
						{
							val = va_arg(args, unsigned long);
							size = sizeof(unsigned long);
						}
						else if (strcmp(modifier, "ll") == 0)
						{
							val = va_arg(args, unsigned long long);
							size = sizeof(unsigned long long);
						}
						else if (strcmp(modifier, "j") == 0)
						{
							val = va_arg(args, uintmax_t);
							size = sizeof(uintmax_t);
						}
						else if (strcmp(modifier, "z") == 0)
						{
							val = va_arg(args, size_t);
							size = sizeof(size_t);
						}
						else if (strcmp(modifier, "t") == 0)
						{
							val = va_arg(args, ptrdiff_t);		// should be unsigned
							size = sizeof(ptrdiff_t);
						}
						else
						{
							val = va_arg(args, unsigned int);
							
							if (strcmp(modifier, "h") == 0)
							{
								val = (unsigned short)(val);
								size = sizeof(unsigned short);
							}
							else if (strcmp(modifier, "hh") == 0)
							{
								val = (unsigned char)(val);
								size = sizeof(unsigned char);
							}
							else
								size = sizeof(unsigned int);
						}
						
						size *= 8;
						
						const bool alt = std::strchr(flags, '#'), left = std::strchr(flags, '-');
						const char pad = (!std::strchr(flags, '0') || left || precision[0]) ? ' ' : '0';
						
						bool found = false;
						
						size_t i = 0;
						for (uintmax_t b = uintmax_t(1) << (size - 1); b && n < sizeof(var) - 1; b >>= 1, ++i)
						{
							if (!found)
							{
								if ((val & b) || size - i <= prec)
								{
									found = true;
									
									if (alt)
									{
										var[n++] = '0';
										var[n++] = *p;
									}
									
									while (prec > size && n < sizeof(var) - 1 - size)
									{
										var[n++] = '0';
										--prec;
									}
								}
								else
									continue;
							}
							
							var[n++] = (val & b) ? '1' : '0';
						}
						
						if (!found && prec > 0)
							var[n++] = '0';
						
						if (n < fw)
						{
							if (left)
							{
								while (n < fw && n < sizeof(var) - 1)
									var[n++] = pad;
							}
							else
							{
								const size_t len = std::min(size_t(fw) - n, sizeof(var) - 1 - n);
								std::fill_n(var + n, len, pad);
								dispatch_chunk({var + n, len});
							}
						}
						
						break;
					}
					
					default:
						return;
				}
				
				if (n < 0)
					return;
				else if (n > 0)
				{
					dispatch_chunk({var, std::min((size_t)n, sizeof(var) - 1)});
					written += std::min((size_t)n, sizeof(var) - 1);
					
					if (n >= sizeof(var))
					{
						dispatch_chunk("..."sv);
						written += 3;
					}
				}
			}
			
			const bool none = level == Level::None;
			dispatch_chunk({fmt, (size_t)(p - fmt)}, none);
			
			if (!none)
				dispatch_chunk("\n"sv, true);
			
			if (level == Level::Error && error_handler)
				error_handler();
			
			if (level == Level::Fatal && fatal_handler)
				fatal_handler();
		}
		
		template <class... Args>
		void n(const char *fmt, Args... args) const { if (isEnabled()) log(Level::None, fmt, args...); }
		
		template <class... Args>
		void f(const char *fmt, Args... args) const { log(Level::Fatal, fmt, args...); }
		
		template <class... Args>
		void e(const char *fmt, Args... args) const { log(Level::Error, fmt, args...); }
		
		template <class... Args>
		void w(const char *fmt, Args... args) const { log(Level::Warning, fmt, args...); }
		
		template <class... Args>
		void i(const char *fmt, Args... args) const { log(Level::Info, fmt, args...); }
		
		template <class... Args>
		void d(const char *fmt, Args... args) const { log(Level::Debug, fmt, args...); }
		
