SMMB-DEV/STM32-Tools/Log.hpp
	private:
		void dispatch_chunk(strv data, bool last = false) const
		{
			for (auto out : outputs)
				if (out)
					out(data, last);
		}
		
		void dispatch_format(strv format) const
		{
			dispatch_chunk("["sv);
			dispatch_chunk(format);
			dispatch_chunk("]"sv);
		}
		
		static bool extract_conv_spec(const char *chars, char *spec, size_t spec_len, const char * &p)
		{
			const char *const start = p;
			while (strchr(chars, *p))
			{
				*spec++ = *p++;
				if (p - start >= spec_len)
					return false;
			}
			
			*spec = '\0';
			
			return *p != '\0';
		}
		
		template <typename T>
		static int format(char *const var, const size_t var_len, const char *const spec, const bool has_field_width, const bool has_precision, va_list& args)
		{
			int field_width;
			if (has_field_width)
				field_width = va_arg(args, int);
			
			int precision;
			if (has_precision)
				precision = va_arg(args, int);
			
			if (has_field_width && has_precision)
				return snprintf(var, var_len, spec, field_width, precision, va_arg(args, T));
			else if (has_field_width)
				return snprintf(var, var_len, spec, field_width, va_arg(args, T));
			else if (has_precision)
				return snprintf(var, var_len, spec, precision, va_arg(args, T));
			else
				return snprintf(var, var_len, spec, va_arg(args, T));
		}
	};
	
	#ifndef STM32T_DEFAULT_LOG_LEVEL
	#define	STM32T_DEFAULT_LOG_LEVEL			Level::None
	#endif
	
	#ifndef STM32T_DEFAULT_LOG_NAME
	#define	STM32T_DEFAULT_LOG_NAME				""sv
	#endif
	
	#ifndef STM32T_DEFAULT_LOG_OUTPUT
	#define	STM32T_DEFAULT_LOG_OUTPUT			std::array{default_output_stdout}
	#endif
	
	#ifndef STM32T_DEFAULT_LOG_TIMESTAMP
	#define	STM32T_DEFAULT_LOG_TIMESTAMP		default_timestamp
	#endif
	
	#ifndef STM32T_DEFAULT_LOG_ERROR_HANDLER
	#define	STM32T_DEFAULT_LOG_ERROR_HANDLER	nullptr
	#endif
	
	#ifndef STM32T_DEFAULT_LOG_FATAL_HANDLER
	#define	STM32T_DEFAULT_LOG_FATAL_HANDLER	&Error_Handler
	#endif
	
	inline constexpr Logger g_defaultLogger(STM32T_DEFAULT_LOG_LEVEL, STM32T_DEFAULT_LOG_NAME, STM32T_DEFAULT_LOG_OUTPUT, STM32T_DEFAULT_LOG_TIMESTAMP,
		STM32T_DEFAULT_LOG_ERROR_HANDLER, STM32T_DEFAULT_LOG_FATAL_HANDLER);
	
	template <auto& logger = g_defaultLogger>
	[[gnu::always_inline]]
	constexpr inline bool IsEnabled()
	{
		return logger.isEnabled();
	}
	
	template <auto& logger = g_defaultLogger>
	[[gnu::always_inline]]
	constexpr inline bool IsEnabled(const Level level)
	{
		return logger.isEnabled(level);
	}
	
	template <const Level level, auto& logger = g_defaultLogger, class... Args>
	[[gnu::always_inline]]
	void _LOG(const char *fmt, Args... args)
	{
		if constexpr (logger.isEnabled(level))
			logger.log(level, fmt, args...);
	}
	
	
	// todo: Use macros for default logger
	template <const Level level = Level::None, auto& logger = g_defaultLogger, class... Args>
	[[gnu::always_inline]]
	inline void LOG_N(const char *fmt, Args... args)
	{
		if constexpr (logger.isEnabled() && logger.isEnabled(level))
			logger.log(Level::None, fmt, args...);
	}
	
	
	
	template <auto& logger = g_defaultLogger, class... Args>
	void LOG_F(const char *fmt, Args... args) { _LOG<Level::Fatal, logger>(fmt, args...); }
	
	template <auto& logger = g_defaultLogger, class... Args>
	void LOG_E(const char *fmt, Args... args) { _LOG<Level::Error, logger>(fmt, args...); }
	
	template <auto& logger = g_defaultLogger, class... Args>
	void LOG_W(const char *fmt, Args... args) { _LOG<Level::Warning, logger>(fmt, args...); }
	
	template <auto& logger = g_defaultLogger, class... Args>
	void LOG_I(const char *fmt, Args... args) { _LOG<Level::Info, logger>(fmt, args...); }
	
	template <auto& logger = g_defaultLogger, class... Args>
	void LOG_D(const char *fmt, Args... args) { _LOG<Level::Debug, logger>(fmt, args...); }
	
	template <const Level level = Level::None, auto& logger = g_defaultLogger>
	inline void LOGA(const uint8_t *arr, size_t len, const size_t line_count = 16)
	{
		if constexpr (logger.isEnabled() && logger.isEnabled(level))
		{
			while (len)
			{
				for (size_t i = 0; len && i < line_count; i++, len--)
					LOG_N<level, logger>(" %02X", *arr++);
				
				LOG_N<level, logger>("\n");
			}
		}
	}
	
	template <const Level level = Level::None, auto& logger = g_defaultLogger>
	inline void LOGSEP()
	{
		LOG_N<level, logger>("--------------------------------------------------------------------------------\n");
	}
	
	template <const Level level = Level::None, auto& logger = g_defaultLogger>
	inline void Startup()
	{
		if constexpr (logger.isEnabled() && logger.isEnabled(level))
		{
			LOG_N<level, logger>("\n\n\n--------------------------------------------------------------------------------\nStart!\n");
			
			strv ver = VER;
			LOG_N<level, logger>("\nSTM32T v%.*s\n", ver.size(), ver.data());
			
			const uint32_t version = HAL_GetHalVersion();	// major.minor.patch-rc
			
			LOG_N<level, logger>("HAL v%hhu.%hhu.%hhu-rc%hhu\nRevID: 0x%04X, DevID: 0x%03X, UID: 0x%08X%08X%08X\nHCLK: %.1f MHz\n",
				version >> 24, (version >> 16) & 0xFF, (version >> 8) & 0xFF, version & 0xFF,
				HAL_GetREVID(), HAL_GetDEVID(), HAL_GetUIDw0(), HAL_GetUIDw1(), HAL_GetUIDw2(),
				HAL_RCC_GetHCLKFreq() / 1'000'000.0f);
			
			// https://community.st.com/t5/stm32cubeide-mcus/how-can-you-validate-that-independent-watchdog-iwdg-is-resetting/m-p/89220/highlight/true#M2197
			const uint32_t reset_flags = RCC->CSR;
			
			LOG_N<level, logger>("Cause of reset: |");
			
			// b31
			if (reset_flags & RCC_CSR_LPWRRSTF)
				LOG_N<level, logger>(" Low Power |");
			
			// b30
			if (reset_flags & RCC_CSR_WWDGRSTF)
				LOG_N<level, logger>(" WWDG |");
			
			// b29
			if (reset_flags & RCC_CSR_IWDGRSTF)
				LOG_N<level, logger>(" IWDG |");
			
			// b28
			if (reset_flags & RCC_CSR_SFTRSTF)
				LOG_N<level, logger>(" Software |");
			
			// b27
			#ifdef RCC_CSR_PORRSTF
			if (reset_flags & RCC_CSR_PORRSTF)
			#else
			if (reset_flags & RCC_CSR_PWRRSTF)
			#endif
				LOG_N<level, logger>(" POR/PDR |");
			
			// b26
			if (reset_flags & RCC_CSR_PINRSTF)
				LOG_N<level, logger>(" Reset Pin |");
			
			// b25
			#ifdef RCC_CSR_PORRSTF
			if (reset_flags & RCC_CSR_BORRSTF)
				LOG_N<level, logger>(" BOR |");
			#else
			if (reset_flags & RCC_CSR_OBLRSTF)
				LOG_N<level, logger>(" OBL |");
			#endif
			
			LOG_N<level, logger>("\n\n");
		}
	}
}
